{
  "about_intro": "I’m <span style='color: #4fa1ff;'>Julia</span>, a software development student from The Netherlands with a passion for creating clean, user-friendly websites. I first got into web development when my dad introduced me to Swift Playground, where I had a lot of fun playing around with while-loops and if-statements. I also spend some time playing around on Codecademy. Even when family members had questions about something not working on their laptop or phone, I was often the first person they came to for help.",
  "about_paragraph_2": "What I really like about software development is that a software developer can look at a wireframe or mock-up, and based on that can make ideas really come to life. When someone needs adjustments on their websites or has a certain question, they can come to you and you can help them solve their problem. At the moment I’m focused on improving my coding knowledge and am focused on learning back-end and implementing that into front-end.",
  "contact_email_text": "Prefer email? Here's mine: <a href='mailto:j.heemskerk.swd@gmail.com' class='email-call'>j.heemskerk.swd@gmail.com</a>",
  "contact_message_label": "Message:",
  "contact_name_label": "Full name:",
  "contact_submit": "Send message",
  "contact_title": "Let's talk!",
  "cv_text": "Take a look at my CV <i class='fa-solid fa-download'></i>",
  "work_apothecare_description": "A project we had to work on at school. It's a pharmacy website where you can order products, based on real health complaints, and chat with a chatbot for questions. We are working with Vue, which is actually pretty fun and efficient to work with when you understand how it works. <span style='font-style: italic; font-weight: 100;'>PS: take a closer look by clicking the picture.</span>",
  "work_capybara_description": "A school assignment where we had to create a game using classes and objects. User plays as a capybara and needs to find as much food as possible, all while being chased by spiders. There are hearts around the map that can make you gain health again. There are some bugs, since it was our first big project, but it was a good learning experience. <span style='font-style: italic; font-weight: 100;'>PS: take a closer look by clicking the picture.</span>",
  "work_capybara_tech_1": "Animations",
  "work_comicverse_description": "We are currently learning about databases, so we had to design a website that we later are going to develop to get a better understanding of how databases work and how to use them ourselves. I designed a comic website where you can take a closer look at comics, and see information like the author, artist, description and links on where to buy the comics. <span style='font-style: italic; font-weight: 100;'>PS: take a closer look by clicking the picture.</span>",
  "work_energy_description": "During a project week, we were given a number of data and had to create an energy dashboard with it. I worked on visualizing the data on the website using Chart.js, creating charts that made the information easy to understand. This project helped me practise working with data, front-end development and using external libraries to build a functional and user-friendly interface. <span style='font-style: italic; font-weight: 100;'>PS: take a closer look by clicking the picture.</span>",
  "work_energy_tech_1": "Data Visualization",
  "work_energy_title": "Energy Dashboard",
  "work_skyteller_description": "A responsive web application that fetches real-time weather data using the <a href='https://openweathermap.org/' target='_blank' style='color: #4fa1ff; text-decoration: none;'>openweathermap</a> external API. Users can search for any city to view current conditions, temperature, and forecasts in a clean, intuitive interface. I had fun figuring out how to use API's for the first time.",
  "work_zelda_description": "A personal project of mine. I really enjoyed the game Zelda Breath of the Wild, and thought; why not make a website out of it? It's an infographic-style website where you can see the characters, read about the lore, and see the map of the game. I'm only in the design-phase, but am excited to work on it."
}