{
  "about_intro": "Ik ben <span style='color: #4fa1ff;'>Julia</span>, een software development student uit Nederland met een passie voor het creëren van strakke, gebruiksvriendelijke websites. Ik ben begonnen met web development toen mijn vader me Swift Playground liet zien, waar ik veel plezier had met het spelen met while-loops en if-statements. Ik heb ook wat tijd doorgebracht op Codecademy. Zelfs als familieleden vragen hadden over iets dat niet werkte op hun laptop of telefoon, was ik vaak de eerste aan wie ze om hulp vroegen.",
  "about_paragraph_2": "Wat ik echt leuk vind aan softwareontwikkeling, is dat een softwareontwikkelaar naar een wireframe of mock-up kan kijken en op basis daarvan ideeën echt tot leven kan brengen. Als iemand aanpassingen op zijn website nodig heeft of een specifieke vraag heeft, kan hij bij jou terecht en kun jij hem helpen met het oplossen van zijn probleem. Momenteel concentreer ik me op het verbeteren van mijn programmeerkennis en het leren van back-end en het implementeren daarvan in front-end.",
  "contact_email_text": "Liever e-mail? Hier is de mijne: <a href='mailto:j.heemskerk.swd@gmail.com' class='email-call'>j.heemskerk.swd@gmail.com</a>",
  "contact_message_label": "Bericht:",
  "contact_name_label": "Volledige naam:",
  "contact_submit": "Bericht verzenden",
  "contact_title": "Laten we praten!",
  "cv_text": "Bekijk mijn CV <i class='fa-solid fa-download'></i>",
  "work_apothecare_description": "Een project waar we op school aan moesten werken. Het is een apotheekwebsite waar je producten kunt bestellen op basis van echte gezondheidsklachten, en waar je met een chatbot kunt chatten voor vragen. We werken met Vue, wat eigenlijk best leuk en efficiënt is om mee te werken als je eenmaal begrijpt hoe het werkt. <span style='font-style: italic; font-weight: 100;'>PS: bekijk het van dichterbij door op de afbeelding te klikken.</span>",
  "work_capybara_description": "Een schoolopdracht waarbij we een spel moesten maken met klassen en objecten. De gebruiker speelt als een capibara en moet zoveel mogelijk voedsel vinden, terwijl hij wordt achtervolgd door spinnen. Er zijn hartjes op de kaart die je gezondheid kunnen herstellen. Er zitten wat bugs in, aangezien dit ons eerste grote project was, maar het was een goede leerervaring. <span style='font-style: italic; font-weight: 100;'>PS: bekijk het van dichterbij door op de afbeelding te klikken.</span>",
  "work_capybara_tech_1": "Animaties",
  "work_comicverse_description": "We zijn momenteel bezig met het leren over databases, dus moesten we een website ontwerpen die we later gaan ontwikkelen om beter te begrijpen hoe databases werken en hoe we ze zelf kunnen gebruiken. Ik heb een stripwebsite ontworpen waar je strips van dichterbij kunt bekijken, met informatie zoals de auteur, tekenaar, beschrijving en links naar verkooppunten. <span style='font-style: italic; font-weight: 100;'>PS: bekijk het van dichterbij door op de afbeelding te klikken.</span>",
  "work_energy_description": "Tijdens een projectweek kregen we een aantal data aangeleverd en moesten we er een energiedashboard mee maken. Ik werkte aan het visualiseren van de data op de website met Chart.js en maakte grafieken die de informatie gemakkelijk te begrijpen maakten. Dit project hielp me te oefenen met het werken met data, front-end development en het gebruik van externe bibliotheken om een functionele en gebruiksvriendelijke interface te bouwen. <span style='font-style: italic; font-weight: 100;'>PS: bekijk het van dichterbij door op de afbeelding te klikken.</span>",
  "work_energy_tech_1": "Data visualisatie",
  "work_energy_title": "Energie Dashboard",
  "work_skyteller_description": "Een responsieve webapplicatie die realtime weergegevens ophaalt met behulp van de externe API van <a href='https://openweathermap.org/' target='_blank' style='color: #4fa1ff; text-decoration: none;'>openweathermap</a>. Gebruikers kunnen naar elke stad zoeken om de huidige omstandigheden, temperatuur en voorspellingen te bekijken in een overzichtelijke, intuïtieve interface. Ik vond het leuk om voor het eerst uit te vinden hoe je API&#39;s gebruikt.",
  "work_zelda_description": "Een persoonlijk project van mij. Ik vond de game Zelda Breath of the Wild echt geweldig en dacht: waarom maak ik er geen website van? Het is een website in infographic-stijl waar je de personages kunt zien, over de achtergrond kunt lezen en de kaart van de game kunt bekijken. Ik ben nog maar in de ontwerpfase, maar ik heb er zin in."
}